WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
#if defined(USE_MEADOW_DEBUG_HELPERS)
    MEADOW_TRACE_INFORMATION("Using %s configuration\n", (meadow_configuration->using_default_configuration == 1) ? "default" : "user");
    MEADOW_TRACE_INFORMATION("Device Information:\n");
    MEADOW_TRACE_INFORMATION("    Device name: %s\n", meadow_configuration->device_name);
    MEADOW_TRACE_INFORMATION("    Reboot on unhandled exception: %d\n", meadow_configuration->reboot_on_unhandled_exceptions);
    MEADOW_TRACE_INFORMATION("    Initialisation timeout: %d seconds\n", meadow_configuration->initialisation_timeout_seconds);
    MEADOW_TRACE_INFORMATION("    SD storage enabled: %d\n", meadow_configuration->sd_storage_supported);
    MEADOW_TRACE_INFORMATION("Mono Control:\n");
    MEADOW_TRACE_INFORMATION("    Options: %s\n", (meadow_configuration->mono_options == NULL) ? "None configured" : meadow_configuration->mono_options);
    MEADOW_TRACE_INFORMATION("Coprocessor:\n");
    MEADOW_TRACE_INFORMATION("    SPI speed: %d Hz\n", meadow_configuration->esp_spi_speed_hz);
    MEADOW_TRACE_INFORMATION("    Automatically start network: %d\n", meadow_configuration->automatically_start_network);
    MEADOW_TRACE_INFORMATION("    Automatically reconnect: %d\n", meadow_configuration->automatically_reconnect);
    MEADOW_TRACE_INFORMATION("    Maximum retry count: %d\n", meadow_configuration->maximum_retry_count);
    char address[INET_ADDRSTRLEN];
    MEADOW_TRACE_INFORMATION("Network:\n");
    MEADOW_TRACE_INFORMATION("    Ethernet:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_IFT_ETHERNET]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_IFT_ETHERNET].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ETHERNET].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ETHERNET].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ETHERNET].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    WiFi:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_IFT_ESP32]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_IFT_ESP32].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ESP32].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ESP32].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_ESP32].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    BG770A:\n");
    MEADOW_TRACE_INFORMATION("        Default: %d\n", meadow_configuration->default_interface == &network_interfaces[MEADOW_IFT_CELL]);
    MEADOW_TRACE_INFORMATION("        Use DHCP: %d\n", network_interfaces[MEADOW_IFT_CELL].use_dhcp);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_CELL].ip_address, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        IP Address: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_CELL].netmask, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Subnet mask: %s\n", address);
    inet_ntop(AF_INET, &network_interfaces[MEADOW_IFT_CELL].gateway, address, INET_ADDRSTRLEN);
    MEADOW_TRACE_INFORMATION("        Gateway: %s\n", address);
    MEADOW_TRACE_INFORMATION("    Get network time at startup: %d\n", meadow_configuration->get_network_time_at_startup);
    MEADOW_TRACE_INFORMATION("    NTP refresh period: %d seconds\n", meadow_configuration->ntp_refresh_period_seconds);
    MEADOW_TRACE_INFORMATION("    NTP Servers (%d):\n", meadow_configuration->ntp_servers_count);
    int index = 0;
    for (index = 0; index < meadow_configuration->ntp_servers_count; index++)
    {
        inet_ntop(AF_INET, &meadow_configuration->ntp_servers[index], address, INET_ADDRSTRLEN);
        MEADOW_TRACE_INFORMATION("        - %s\n", address);
    }
    MEADOW_TRACE_INFORMATION("    DNS Servers:\n");
    FILE *dns_file = fopen(CONFIG_NETDB_RESOLVCONF_PATH, "rb");
    char buffer[32];
    while (fgets(buffer, 32, dns_file) != NULL)
    {
        MEADOW_TRACE_INFORMATION("        - %s", (buffer + 11));
    }
    fclose(dns_file);
    MEADOW_TRACE_INFORMATION("Internal Debug:\n");
    MEADOW_TRACE_INFORMATION("    Use UART for trace: %d\n", meadow_configuration->use_uart1_for_trace);
    MEADOW_TRACE_INFORMATION("    Trace level: %d\n", meadow_configuration->trace_level);
    MEADOW_TRACE_INFORMATION("    Debugger attached to ESP32: %d\n", (meadow_configuration->reset_esp32_at_startup == 1) ? 0 : 1);
#endif

    return(meadow_configuration);
}

/****************************************************************************
 * Name: hcom_nx_config_get_uint32_value
 *
 * Description:
 *  Get a uint32_t configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration value to be copied.
 *  destination - destination buffer to hold the value.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_uint32_value(int source, uint8_t *destination, int destination_length)
{
    if (destination_length < sizeof(uint32_t))
    {
        return(ERROR);
    }
    *((uint32_t *) destination) = source;
    return(sizeof(uint32_t));
}

/****************************************************************************
 * Name: hcom_nx_config_get_uint8_value
 *
 * Description:
 *  Get a uint8_t configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration value to be copied.
 *  destination - destination buffer to hold the value.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_uint8_value(uint8_t source, uint8_t *destination, int destination_length)
{
    int result = ERROR;

    if (destination_length > 0)
    {
        *destination = source;
        result = 1;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_string_value
 *
 * Description:
 *  Get a string configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration string to be copied.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_string_value(char *source, uint8_t *destination, int destination_length)
{
    int result = ERROR;
    
    if (source == NULL)
    {
        if ((destination != NULL) && (destination_length > 0))
        {
            *destination = 0;
            result = 0;
        }
    }
    else
    {
        if ((strlen(source) + 1) <= destination_length)
        {
            result = strlen(strcpy((char *) destination, source));
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_ip_address
 *
 * Description:
 *  Get an IP address or 0 if DHCP is enabled.
 *
 * Input Parameters:
 *  use_dhcp - use DHCP.
 *  ip_address - IP address to be used if DHCP is not enabled.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_ip_address(bool use_dhcp, uint32_t ip_address, uint8_t *destination, int destination_length)
{
    if (use_dhcp)
    {
        return(hcom_nx_config_get_uint32_value(0, destination, destination_length));
    }
    return(hcom_nx_config_get_uint32_value(ip_address, destination, destination_length));
}

/****************************************************************************
 * Name: hcom_nx_config_get_bytes
 *
 * Description:
 *  Get a byte array configuration value and copy it to the destination buffer.
 *
 * Input Parameters:
 *  source - configuration bytes to be copied.
 *  source_length - length of the source buffer.
 *  destination - destination buffer to hold the string.
 *  dest_length - length of the destination buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
static int hcom_nx_config_get_bytes(uint8_t *source, int source_length, uint8_t *destination, int destination_length)
{
    int result;

    if (source_length > destination_length)
    {
        result = ERROR;
    }
    else
    {
        memcpy(destination, source, source_length);
        result = source_length;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_unique_id
 *
 * Description:
 *  get the unique ID from the config and format this into a string.
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *  buffer - Buffer to hold the unique ID string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  The config object is locked and released by the caller.
 *
 ****************************************************************************/
static int hcom_nx_config_get_unique_id(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result;

    if (buffer_length > 35)
    {
        result = snprintf((char *) buffer, buffer_length, "%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x-%02x",
                    config->serial_number[0], config->serial_number[1], config->serial_number[2],
                    config->serial_number[3], config->serial_number[4], config->serial_number[5],
                    config->serial_number[6], config->serial_number[7], config->serial_number[8],
                    config->serial_number[9], config->serial_number[10], config->serial_number[11]);
    }
    else
    {
        result = ERROR;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_get_serial_number
 *
 * Description:
 *  get the chip serial number from the config and format this into a string.
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *  buffer - Buffer to hold the serial number string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  The config object is locked and released by the caller.
 *
 ****************************************************************************/
int hcom_nx_config_get_serial_number(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result;

    if (buffer_length > 18)
    {
        result = snprintf((char *) buffer, buffer_length, "%02X%02X%02X%02X%02X%02X", config->chip_id[0], config->chip_id[1],
                            config->chip_id[2], config->chip_id[3], config->chip_id[4], config->chip_id[5]);
    }
    else
    {
        result = ERROR;
    }

    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_maximum_retry_count
 *
 * Description:
 *  Set the MaximumRetryCount property passing the new value to the ESP32.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer holding the new value for the MaximumRetryCount
 *           property.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  OK if successful, ERROR otherwise.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_maximum_retry_count(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 4)
    {
        int retryCount = *((int *) buffer);
        result = hcom_nx_config_set_esp_integer_value(espcp_configuration_items_maximum_retry_count, retryCount);
        if (result == OK)
        {
            config->maximum_retry_count = retryCount;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_set_automatically_reconnect
 *
 * Description:
 *  Set the AutomaticallyReconnect property and inform the ESP of the change.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *  buffer - Buffer to hold the Mono version string.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
static int hcom_nx_config_set_automatically_reconnect(meadow_configuration_t *config, uint8_t *buffer, int buffer_length)
{
    int result = ERROR;

    if (buffer_length == 1)
    {
        result = hcom_nx_config_set_esp_boolean_value(espcp_configuration_items_automatically_reconnect, *buffer);
        if (result == OK)
        {
            config->automatically_reconnect = *buffer;
        }
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_version_string
 *
 * Description:
 *  Get the version string (or string representing an unknown value).
 *
 * Input Parameters:
 *  version - Pointer to the version information.
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_version_string(meadow_version_number_t *version, uint8_t *buffer, int buffer_length)
{
    int result = 0;

    if (version->short_string == NULL)
    {
        result = hcom_nx_config_get_string_value(UNKNOWN_VERSION_STRING, buffer, buffer_length);
    }
    else
    {
        result = hcom_nx_config_get_string_value(version->short_string, buffer, buffer_length);
    }
    return(result);
}

/****************************************************************************
 * Name: hcom_nx_config_get_build_date
 *
 * Description:
 *  Get the OS build date.
 *
 * Input Parameters:
 *  version - Version information.
 *  buffer - Buffer to hold the value when reading, or holding the new value
 *           when writing.
 *  buffer_length - Length of the buffer.
 *
 * Returned Value:
 *  Amount of data copied or a negative number on error.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
int hcom_nx_config_get_build_date(meadow_version_number_t *version, uint8_t *buffer, int buffer_length)
{
    int result = 0;

