WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
        if (config->default_cell_settings != NULL && 
            settings->settings->apn != NULL && 
            strlen(settings->settings->apn) <= MAXIMUM_APN_LENGTH && 
            strlen(settings->settings->apn) > 0) 
        {
            config->default_cell_settings->apn = kmm_strdup(settings->settings->apn);
            syslog(LOG_INFO, "Default cell APN loaded: %s\n", config->default_cell_settings->apn);

            config->default_cell_settings->timeout = (settings->settings->timeout != NULL && 
                                                    strlen(settings->settings->timeout) <= MAXIMUM_TIMEOUT_LENGTH && 
                                                    strlen(settings->settings->timeout) > 0) ? 
                                                    kmm_strdup(settings->settings->timeout) : 
                                                    kmm_strdup(DEFAULT_CELL_PPPD_TIMEOUT);

            syslog(LOG_INFO, "Default cell PPPD timeout loaded: %s\n", config->default_cell_settings->timeout);

            config->default_cell_settings->pap_user = (settings->settings->user != NULL && 
                                                        strlen(settings->settings->user) <= MAXIMUM_USER_LENGTH && 
                                                        strlen(settings->settings->user) > 0) ? 
                                                        kmm_strdup(settings->settings->user) : 
                                                        kmm_strdup(DEFAULT_CELL_PAP_USER);

            syslog(LOG_INFO, "Default cell PAP username loaded: %s\n", config->default_cell_settings->pap_user);

            config->default_cell_settings->pap_password = (settings->settings->password != NULL && 
                                                            strlen(settings->settings->password) <= MAXIMUM_PASSWORD_LENGTH && 
                                                            strlen(settings->settings->password) > 0) ? 
                                                            kmm_strdup(settings->settings->password) : 
                                                            kmm_strdup(DEFAULT_CELL_PAP_PASSWORD);

            syslog(LOG_INFO, "Default cell PAP password loaded: %s\n", config->default_cell_settings->pap_password);

            config->default_cell_settings->ttyname = (settings->settings->ttyname != NULL && 
                                                        strlen(settings->settings->ttyname) <= MAXIMUM_INTERFACE_LENGTH && 
                                                        strlen(settings->settings->ttyname) > 0) ? 
                                                        kmm_strdup(settings->settings->ttyname) : 
                                                        kmm_strdup(DEFAULT_CELL_INTERFACE);

            syslog(LOG_INFO, "Default cell interface name loaded: %s\n", config->default_cell_settings->ttyname);

            config->default_cell_settings->mode = (settings->settings->mode != NULL && 
                                                        strlen(settings->settings->mode) <= MAXIMUM_MODE_LENTGH && 
                                                        strlen(settings->settings->mode) > 0) ? 
                                                        kmm_strdup(settings->settings->mode) : 
                                                        kmm_strdup(DEFAULT_CELL_MODE);

            syslog(LOG_INFO, "Default cell operation mode loaded: %s\n", config->default_cell_settings->mode);

            config->default_cell_settings->operator = (settings->settings->operator != NULL && 
                                            strlen(settings->settings->operator) <= MAXIMUM_OPERATOR_LENGTH && 
                                            strlen(settings->settings->operator) > 0) ? 
                                            kmm_strdup(settings->settings->operator) : 
                                            kmm_strdup(DEFAULT_CELL_OPERATOR);

            syslog(LOG_INFO, "Default cell operator loaded: %s\n", config->default_cell_settings->operator);

            config->default_cell_settings->module = (settings->settings->module != NULL && 
                                            strlen(settings->settings->module) <= MAXIMUM_MODULE_LENGTH && 
                                            strlen(settings->settings->module) > 0) ? 
                                            kmm_strdup(settings->settings->module) : 
                                            kmm_strdup(CELL_UNKNOWN_MODULE_NAME);

            syslog(LOG_INFO, "Default cell module loaded: %s\n", config->default_cell_settings->module);

            hcom_nx_populate_cell_module_id(config);

            syslog(LOG_INFO, "Default cell module id populated: %u\n", config->default_cell_settings->module_id);

            hcom_nx_populate_cell_network_mode_id(config);

            syslog(LOG_INFO, "Default cell network mode id populated: %u\n", config->default_cell_settings->mode_id);

            hcom_nx_map_cell_network_mode(config);

            syslog(LOG_INFO, "Default cell operation mode updated after mapping: %s\n", config->default_cell_settings->mode);
        }
        else
        {
            if (config->default_cell_settings != NULL) 
            {
                free(config->default_cell_settings);
                config->default_cell_settings = NULL;
            }
            syslog(LOG_ERR, "Failed to get default cell settings\n");
        }

        hcom_nx_config_unlock();
        cyaml_free(&cyaml_config, &cell_settings_schema, settings, 0);
        syslog(LOG_INFO, "Cyaml free\n");
    }
    
    //  TODO: Delete file after reading in the case of a private APN
    
}

/****************************************************************************
 * Name: hcom_nx_config_set_time_to_os_build_time
 *
 * Description:
 *  Use the OS build time as the minimum initial value for the system clock.
 * 
 *  SSL certificate validation requires the clock to be set to a recent time.
 *  The board must be operating after the OS build time so using this gives
 *  the board a starting point.  A more accurate clock can be set later
 *  using NTP.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None.
 *
 ****************************************************************************/
void hcom_nx_config_set_time_to_os_build_time(void)
{
    struct timespec tp;
    clock_gettime(CLOCK_REALTIME, &tp);
    if (tp.tv_sec < HCOM_DEVICE_INFO_BUILD_EPOCH_TIME)
    {
        tp.tv_sec = HCOM_DEVICE_INFO_BUILD_EPOCH_TIME;
        tp.tv_nsec = 0;
        clock_settime(CLOCK_REALTIME, &tp);
    }
}

/****************************************************************************
 * Name: hcom_nx_turn_on_the_cell_module
 *
 * Description:
 *  Function to turn on the cell module, which can vary according to
 *  the meadow device pinout and modem model used.
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  For now, it's only working for some cell modules with the 
 *  Meadow F7v2 Feather. But, further it can be used as a generic 
 *  function to turn on the modules using different meadow devices.
 *
 ****************************************************************************/
void hcom_nx_turn_on_the_cell_module()
{
    uint32_t module_id; 
    module_id = hcom_nx_config_get_cell_module_id();
    
