WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/hcom_nx/hcom_nx_config_manager.c
    switch(module_id)
    {
        case CELL_BG770A_MODULE:
            // Low pulse for 3 seconds to turn on the Quectel BG770A-GL cell module
            syslog(LOG_INFO, "Turning on BG770A module");
            stm32_configgpio(GPIO_OUTPUT | GPIO_FLOAT | GPIO_OPENDRAIN | F7_MICRO_V2_D10_PIN); 
            stm32_gpiowrite(F7_MICRO_V2_D10_PIN, false);
            usleep(3000000);
            stm32_gpiowrite(F7_MICRO_V2_D10_PIN, true);
            stm32_gpiowrite(F7_MICRO_V2_D10_PIN, false);
        break;

        case CELL_M95_MODULE:
            syslog(LOG_INFO, "Turning on M95 module");
            stm32_configgpio(GPIO_OUTPUT | F7_MICRO_V2_D10_PIN);
            stm32_gpiowrite(F7_MICRO_V2_D10_PIN, true);
        break;

        case CELL_BG95M3_MODULE:
            syslog(LOG_INFO, "Turning on BG95-M3 module");
            stm32_configgpio(GPIO_OUTPUT | F7_MICRO_V2_D10_PIN);
            stm32_gpiowrite(F7_MICRO_V2_D10_PIN, false);
        break;

        default:
            syslog(LOG_INFO, "Failed to identify and turn on the cell module");
        break;

    }
    
    // TODO: Add support to turn on the BG770A-GL on the Project Lab and for
    // Meadow F7v1 Feather
}

/****************************************************************************
 * Name: hcom_nx_populate_cell_module_id
 *
 * Description:
 *  Populate the cell module id according to the cell module name set in
 *  the cell.config.yaml
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_populate_cell_module_id(meadow_configuration_t *config)
{
    if (config == NULL || config->default_cell_settings == NULL || config->default_cell_settings->module == NULL)
    {
        syslog(LOG_INFO, "Failed getting cell default settings");
        return;
    }

    if (strcasecmp(config->default_cell_settings->module, CELL_BG770A_MODULE_NAME) == 0)
    {
        config->default_cell_settings->module_id = CELL_BG770A_MODULE;
    }
    else if (strcasecmp(config->default_cell_settings->module, CELL_M95_MODULE_NAME) == 0)
    {
        config->default_cell_settings->module_id = CELL_M95_MODULE;
    }
    else if (strcasecmp(config->default_cell_settings->module, CELL_BG95M3_MODULE_NAME) == 0)
    {
        config->default_cell_settings->module_id = CELL_BG95M3_MODULE;
    }
    else
    {
        syslog(LOG_INFO, "Failed populating cell module id");
        config->default_cell_settings->module_id = CELL_UNKNOWN_MODULE;
    }
}

/****************************************************************************
 * Name: hcom_nx_populate_cell_network_mode_id
 *
 * Description:
 *  Populate the cell network mode id according to the mode set
 *  in the cell.config.yaml
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_populate_cell_network_mode_id(meadow_configuration_t *config)
{
    if (config == NULL || config->default_cell_settings == NULL || config->default_cell_settings->mode == NULL)
    {
        syslog(LOG_INFO, "Failed getting default cell settings");
        return;
    }

    if (strcasecmp(config->default_cell_settings->mode, CELL_CATM1_MODE_NAME) == 0)
    {
        config->default_cell_settings->mode_id = CELL_CATM1_MODE;
    }
    else if (strcasecmp(config->default_cell_settings->mode, CELL_NBIOT_MODE_NAME) == 0)
    {
        config->default_cell_settings->mode_id = CELL_NBIOT_MODE;
    }
    else if (strcasecmp(config->default_cell_settings->mode, CELL_GSM_MODE_NAME) == 0)
    {
        config->default_cell_settings->mode_id = CELL_GSM_MODE;
    }
    else
    {
        syslog(LOG_INFO, "Failed populating cell network mode id");
        config->default_cell_settings->mode_id = CELL_UNKNOWN_MODE;
    }
}

/****************************************************************************
 * Name: hcom_nx_map_cell_network_mode
 *
 * Description:
 *  Map the cell network mode according to the Mode defined in
 *  the cell.config.yaml, since different modules may use distinct integers 
 *  to reference network modes (e.g., Cat-M1 is 8 for Quectel BG95-M3, 
 *  but 7 for Quectel BG770A).
 *
 * Input Parameters:
 *  config - Pointer to the system config object
 *
 * Returned Value:
 *  None
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_map_cell_network_mode(meadow_configuration_t *config)
{
    if (config == NULL || config->default_cell_settings == NULL)
    {
        syslog(LOG_INFO, "Failed getting default cell settings");
        return;
    }

    uint32_t module = config->default_cell_settings->module_id;
    uint32_t mode = config->default_cell_settings->mode_id;

    switch (module)
    {
    case CELL_BG770A_MODULE:
        switch (mode)
        {
        case CELL_CATM1_MODE:
            strcpy(config->default_cell_settings->mode, "7");
            break;
        case CELL_NBIOT_MODE:
            strcpy(config->default_cell_settings->mode, "9");
            break;
        default:
            syslog(LOG_INFO, "Mode %u not supported on BG770A module", mode);
            strcpy(config->default_cell_settings->mode, "");
            break;
        }
        break;

    case CELL_BG95M3_MODULE:
        switch (mode)
        {
        case CELL_CATM1_MODE:
            strcpy(config->default_cell_settings->mode, "8");
            break;
        case CELL_NBIOT_MODE:
            strcpy(config->default_cell_settings->mode, "9");
            break;
        case CELL_GSM_MODE:
            strcpy(config->default_cell_settings->mode, "0");
            break;
        default:
            syslog(LOG_INFO, "Mode %u not supported on BG95-M3 module", mode);
            strcpy(config->default_cell_settings->mode, "");
            break;
        }
        break;

    case CELL_M95_MODULE:
        switch (mode)
        {
        case CELL_GSM_MODE:
            strcpy(config->default_cell_settings->mode, "0");
            break;
        default:
            syslog(LOG_INFO, "Mode %u not supported on M95 module", mode);
            strcpy(config->default_cell_settings->mode, "");
            break;
        }
        break;

    default:
        syslog(LOG_INFO, "Failed to map cell network mode name to the equivalent integer");
        strcpy(config->default_cell_settings->mode, "");
        break;
    }
}

/****************************************************************************
 * Name: hcom_nx_config_refresh_mono_version
 *
 * Description:
 *  Refresh the mono version in the specified configuration object.
 *
 * Input Parameters:
 *  config - Pointer to the system configuration object.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  The configuration object must be locked before this method is called.
 *
 ****************************************************************************/
void hcom_nx_config_refresh_mono_version(meadow_configuration_t *config)
{
    uint32_t block_size = hcom_nx_exec_ex_flash_get_block_size();

    mono_signature_t *mono_signature = (mono_signature_t *) kmm_zalloc(block_size);
    if (mono_signature != NULL)
    {
        hcom_nx_exec_ex_flash_read_absolute_block(0, (void *) mono_signature);
        memset(&config->mono_version, 0, sizeof(meadow_version_number_t));
        if (mono_signature->signature != 0xDDCCBBAA)
        {
            syslog(LOG_ERR, "Mono runtime was not found flashed in external flash.\n");
        }
        else
        {
            if ((mono_signature->build & 0x00ffff00) != 0)
            {
                //
                //  For older versions of Meadow.OS.Runtime.bin the version number
                //  was encoded as a single uint32_t.
                //
                //  TODO: Change this after version 1.0 and before version 256.0.
                //
                config->mono_version.revision = (mono_signature->build >> 8) & 0xff;
                config->mono_version.minor = (mono_signature->build >> 16) & 0xff;
                config->mono_version.major = (mono_signature->build  >> 24) & 0xff;
                config->mono_version.build = mono_signature->build & 0xff;
            }
            else
            {
                config->mono_version.build = mono_signature->build;
                config->mono_version.revision = mono_signature->revision;
                config->mono_version.minor = mono_signature->minor;
                config->mono_version.major = mono_signature->major;
                config->mono_version.day = mono_signature->day;
                config->mono_version.month = mono_signature->month;
                hcom_nx_config_set_month_text(&config->mono_version);
                config->mono_version.year = mono_signature->year;
                config->mono_version.hour = mono_signature->hour;
                config->mono_version.minute = mono_signature->minute;
                config->mono_version.second = mono_signature->second;
                config->mono_version.hash = mono_signature->hash;
                config->mono_version.branch_name = kmm_strdup((char *) &mono_signature->start_of_branch_string);
                config->mono_version.short_string = hcom_nx_config_get_short_version_string(&config->mono_version);
                config->mono_version.long_string = hcom_nx_config_get_long_version_string(&config->mono_version);
            }
        }
        kmm_free(mono_signature);
    }
}

/****************************************************************************
 * Name: hcom_nx_config_init
 *
 * Description:
 *  Setup the configuration system and populate the configuration structure
 *  with data from the configuration file.
 * 
 *  Note that one of the side effects of this method is to copy the Mono
 *  runtime into RAM making it ready for use (assuming the runtime file is 
 *  validated OK).
 *
 * Input Parameters:
 *  None.
 *
 * Returned Value:
 *  None.
 *
 * Assumptions/Limitations:
 *  None
 *
 ****************************************************************************/
void hcom_nx_config_init(void)
{
    if (meadow_configuration == NULL)
    {
        sem_init(&config_lock, 0, 1);                   // Create the config lock.
        sem_setprotocol(&config_lock, SEM_PRIO_NONE);
        hcom_nx_config_read_file();

        hcom_nx_config_lock();
        meadow_configuration_t *config = hcom_nx_config_get_pointer();
        hcom_nx_config_set_host_name(config, config->device_name);
        config->hardware_version = meadow_hw_version_get();
        hcom_nx_config_refresh_mono_version(config);
        config->os_version.major = HCOM_DEVICE_INFO_MAJOR;
        config->os_version.minor = HCOM_DEVICE_INFO_MINOR;
        config->os_version.revision = HCOM_DEVICE_INFO_REVISION;
        config->os_version.build = HCOM_DEVICE_INFO_BUILD;
        config->os_version.day = HCOM_DEVICE_INFO_BUILD_DAY;
        config->os_version.month = HCOM_DEVICE_INFO_BUILD_MONTH;
        hcom_nx_config_set_month_text(&config->os_version);
        config->os_version.year = HCOM_DEVICE_INFO_BUILD_YEAR;
        config->os_version.hour = HCOM_DEVICE_INFO_BUILD_HOUR;
        config->os_version.minute = HCOM_DEVICE_INFO_BUILD_MINUTE;
        config->os_version.second = HCOM_DEVICE_INFO_BUILD_SECOND;
        config->os_version.hash = HCOM_DEVICE_INFO_BUILD_HASH_NUMBER;
        config->os_version.branch_name = HCOM_DEVICE_INFO_GIT_REF;
        config->os_version.short_string = hcom_nx_config_get_short_version_string(&config->os_version);
        config->os_version.long_string = hcom_nx_config_get_long_version_string(&config->os_version);
        config->hardware_version_text = meadow_hw_version_string_return();
        stm32_get_uniqueid(config->serial_number);                           // Convert chip Id to serial number
        config->chip_id[0] = config->serial_number[11];                      // 95-88
        config->chip_id[1] = config->serial_number[10] + config->serial_number[2];        // 87-80 + 23-16
        config->chip_id[2] = config->serial_number[9];                       // 79-72
        config->chip_id[3] = config->serial_number[8] + config->serial_number[0] + 10;    // 71-64 + 7-0 + magic 10
        config->chip_id[4] = config->serial_number[7];                       // 63-56
        config->chip_id[5] = config->serial_number[6];                       // 55-48

        hcom_nx_config_unlock();
    }
    else
    {
        syslog(LOG_ERR, "Configuration should only be initialised once.\n");
    }
}
